<details ><summary>apply for portal 2025-01-02 13:14:15 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#portal has been locked by PR #2
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd_autopilot will be created
  + resource "cloudns_dns_record" "renterd_autopilot" {
      + id    = (known after apply)
      + name  = "autopilot.pinner-portal-renterd-cluster.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service: Creation complete after 20s [id=19622013:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd_autopilot: Creating...
cloudns_dns_record.renterd_autopilot: Creation complete after 1s [id=564843916]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30534"
renterd_autopilot_endpoint = "autopilot.pinner-portal-renterd-cluster.node.pinner.xyz"
renterd_bus_endpoint = "bus.pinner-portal-renterd-cluster.node.pinner.xyz"
renterd_workers_endpoints = [
  "worker-1.pinner-portal-renterd-cluster.node.pinner.xyz",
]

```
</details>

</details>